tap "homebrew/bundle"

tap "d12frosted/emacs-plus"
tap "derailed/k9s"
tap "macos-fuse-t/cask"
tap "mas-cli/tap"

brew "aspell"
brew "colima"
brew "coreutils"
brew "derailed/k9s/k9s"
brew "docker"
brew "emacs-plus@29", args: ["with-native-comp"]
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gnupg"
brew "go"
brew "graphviz"
brew "imagemagick"
brew "mas"
brew "pandoc"
brew "pdsh"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "wtfutil"
brew "yq"
brew "zsh-syntax-highlighting"

cask "android-platform-tools"
cask "cryptomator"
cask "discord"
cask "figma"
cask "firefox@nightly"
<<<<<<< Updated upstream
cask "fuse-t"
=======
cask "font-mononoki-nerd-font"
# cask "fuse-t"
>>>>>>> Stashed changes
cask "google-drive"
cask "iterm2@beta"
cask "keepassxc"
cask "logi-options-plus"
cask "maccy"
# cask "notion"
cask "rectangle"
cask "signal"
cask "steam"
cask "telegram"

mas "Parcel", id: 639968404

# Casks that aren't always needed
# cask "ableton-live-suite"  # only on primary computer
# cask "emacs"  # Emacs For MacOS X does not work with Doomemacs
# cask "hammerspoon"  # only with Alacritty
# cask "jiggler"
# cask "mactex"
# brew "terraform"  # prefer asdf
# cask "wireshark"
