tap "homebrew/bundle"

# taps
tap "d12frosted/emacs-plus"
tap "derailed/k9s"
tap "macos-fuse-t/cask"
tap "mas-cli/tap"
brew "mas"

# terminal/tmux/shell experience
cask "alacritty", args: {"no-quarantine": true}
brew "atuin"
brew "coreutils"
cask "font-mononoki-nerd-font"
cask "ghostty@tip"
brew "reattach-to-user-namespace"
brew "tmux"
brew "vivid"
brew "zsh-syntax-highlighting"

# essentials
brew "emacs-plus@29", args: ["with-native-comp"]
brew "fd"
cask "firefox@nightly"
brew "fzf"
brew "gnupg"
cask "hammerspoon"
cask "logi-options-plus"
cask "maccy"
brew "ripgrep"
brew "jq"
brew "yq"

# second-level essentials
brew "colima"
brew "derailed/k9s/k9s"
brew "docker"
brew "gh"
cask "google-drive"
brew "helm"
brew "kubectl"

# linters and code management
brew "aspell"
brew "editorconfig"
brew "go"
brew "ruff"
brew "shellcheck"
brew "shfmt"
brew "uv"

# random tools
brew "ffmpeg"
brew "graphviz"
brew "imagemagick"
brew "pandoc"
brew "pdsh"
brew "presenterm"

# personal computer
cask "android-platform-tools"
cask "cryptomator"
cask "discord"
cask "fuse-t"  # for cryptomator
cask "keepassxc"
cask "signal"
cask "steam"
cask "wireshark"

# mac app store install
mas "Parcel", id: 639968404

# Just to note other formulae used in the past
# cask "ableton-live-suite"  # only one install :c
# cask "emacs"  # Emacs For MacOS X does not work with Doomemacs
# cask "figma"
# cask "jiggler"
# cask "mactex"
# cask "telegram"
# cask "tomatobar"
